IDEA StatiCa Open Model
ConcreteCheckResultBase.NonConformities Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Returns nonconformity in section
 Namespace: IdeaRS.OpenModel.Concrete.CheckResult
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public List<NonConformity> NonConformities { get; set; }
Public Property NonConformities As List(Of NonConformity)
	Get
	Set
public:
property List<NonConformity^>^ NonConformities {
	List<NonConformity^>^ get ();
	void set (List<NonConformity^>^ value);
}
Property Value
Type: List<NonConformity>
See Also
Reference
ConcreteCheckResultBase Class
IdeaRS.OpenModel.Concrete.CheckResult Namespace